##  春节假期在微信上遇到的一个问题，就是按三个取余几个，按五个取差几个的问题，
##  用程序实现，复习一下函数和循环的用法。
##  控制循环变量很重要，减少循环次数对提高效率很有帮助

vvv<-function (x) {
i <- 0
a<-data.frame(0)
for (n in (1:x)) { #最野蛮算法
while  (!(
        ( (i %% 8) ==1) 
        & ( (i %% 9) ==0) 
        & ( (i %%  7)==0  ) 
        & ((i %% 6)==3)  
        & ((5-(i%%5))==1)      
) )
{
        i <- i +1
}
         a[n,1]<-i
         a[n,2]<-i
         i <- i +1
         
}
return(a)
}


vvv1<-function (x) {
        i <- 0
        a<-data.frame(0) 
        for (n in (1:x)) { #稍事调整
                while  (!(
                        ( ((i*63)  %% 8) ==1)   #肯定不是偶数
                        & ( ((i*63) %% 9) ==0) 
                        & ( ((i*63) %%  7)==0  )  #63的整数倍
                        & (((i*63) %% 6)==3)  
                        & ((5-((i*63)%%5))==1)     
                ) )
                {
                        i <- i +1
                }
                a[n,1]<-i*63
                a[n,2]<-i
                i<- i +1
                
        }
        return(a)
}


vvv2<-function (x) {
        a<-data.frame(0)      
               j<-0
        for (n in (1:x)) { #再调整
                while  (!(
                        ( ( (((j)*10+3)*63) %% 8) ==1)    #肯定不是偶数
                        & ( ( (((j)*10+3)*63) %% 9) ==0) 
                        & ( ( (((j)*10+3)*63) %%  7)==0  )  #63的整数倍
                        & (( (((j)*10+3)*63) %% 6)==3)  
                        & ((5-( (((j)*10+3)*63)%%5))==1)     #尾数是4或9  
                ) )                                          #63的3、13、23、33倍
                {        
                        j <- j+1
                        
                }
                a[n,1]<-((j)*10+3)*63   
                a[n,2]<-j
                j<-j+1
               
               }
        return(a)
}

# 仔细分析还能更好的控制循环变量

# > date()
# [1] "Fri Feb 03 15:00:55 2017"
# > vvv(1000)[1000,]
# X0      V2
# 1000 2518929 2518929
# > date()
# [1] "Fri Feb 03 15:01:06 2017"  
# > vvv1(1000)[1000,]   #有调整就有收获
# X0    V2
# 1000 39983 39983
# > date()
# [1] "Fri Feb 03 15:01:06 2017"
# > vvv2(1000)[1000,]
# X0   V2
# 1000 2518929 3998
# > date()
# [1] "Fri Feb 03 15:01:07 2017"


#date()
#vvv(5000)[5000,]  #时间已经不可等待
date()
vvv1(50000)[50000,]
date()
vvv2(50000)[50000,]
date()


# > date()
# [1] "Fri Feb 03 15:05:23 2017"
# > vvv1(50000)[50000,]
# X0      V2
# 50000 125998929 1999983
# > date()
# [1] "Fri Feb 03 15:07:16 2017"
# > vvv2(50000)[50000,]
# X0     V2
# 50000 125998929 199998
# > date()
# [1] "Fri Feb 03 15:09:00 2017"
# > 


# ( (i %% 8) ==1) &( (i %% 9) ==0)
# 
# 
# 
# while  (!(
#         ( (i %% 8) ==0)
#         & ( (i %% 9) ==0)
#         & ( (i %%  7)==0  )
#         & ((i %% 6)==0)
#         & (((i%%5))==0)
# ) )
# {
#         i <- i +1
# }
